In [2]:
import numpy
import pandas

In [3]:
key = ['one', 'two', 'three']
value = [10, 20, 30]

In [4]:
newData = pandas.Series(data=value, index=key)

In [5]:
newData['one']

10

In [6]:
newData.to_frame()

        0
one    10
two    20
three  30

In [7]:
d2 = {
    'one' : 10,
    'two' : 20,
    'three' : 30,
    'four' : 40,
    'five' : 50
}

In [8]:
myData = pandas.Series(d2)

In [9]:
newData

one      10
two      20
three    30
dtype: int64

In [10]:
myData

one      10
two      20
three    30
four     40
five     50
dtype: int64

In [11]:
newData + myData

five      NaN
four      NaN
one      20.0
three    60.0
two      40.0
dtype: float64

In [12]:
dataframe = pandas.DataFrame()

In [13]:
numpy.random.seed(100)

In [14]:
dataframe1 = pandas.DataFrame(numpy.random.randn(3, 5), index=['A', 'B', 'C'], columns=['one', 'two', 'three', 'four', 'five'])

In [15]:
dataframe1

        one       two     three      four      five
A -1.749765  0.342680  1.153036 -0.252436  0.981321
B  0.514219  0.221180 -1.070043 -0.189496  0.255001
C -0.458027  0.435163 -0.583595  0.816847  0.672721

In [16]:
dataframe1['six'] = dataframe1['one'] + dataframe1['five']

In [17]:
dataframe1

        one       two     three      four      five       six
A -1.749765  0.342680  1.153036 -0.252436  0.981321 -0.768445
B  0.514219  0.221180 -1.070043 -0.189496  0.255001  0.769220
C -0.458027  0.435163 -0.583595  0.816847  0.672721  0.214694

In [18]:
dataframe1 = dataframe1.drop('six', axis=1)

In [19]:
dataframe1

        one       two     three      four      five
A -1.749765  0.342680  1.153036 -0.252436  0.981321
B  0.514219  0.221180 -1.070043 -0.189496  0.255001
C -0.458027  0.435163 -0.583595  0.816847  0.672721

In [20]:
dataframe1.drop('five', axis=1, inplace=True)

In [21]:
dataframe1

        one       two     three      four
A -1.749765  0.342680  1.153036 -0.252436
B  0.514219  0.221180 -1.070043 -0.189496
C -0.458027  0.435163 -0.583595  0.816847

In [22]:
dataframe1.drop('B', axis=0, inplace=True)

In [23]:
dataframe1

        one       two     three      four
A -1.749765  0.342680  1.153036 -0.252436
C -0.458027  0.435163 -0.583595  0.816847

In [24]:
dataframe1.shape

(2, 4)

In [25]:
dataframe1

        one       two     three      four
A -1.749765  0.342680  1.153036 -0.252436
C -0.458027  0.435163 -0.583595  0.816847

In [26]:
dataframe1 < 0

    one    two  three   four
A  True  False  False   True
C  True  False   True  False

In [27]:
dataframe1 = pandas.DataFrame(numpy.random.randn(3, 5), index=['A', 'B', 'C'], columns=['one', 'two', 'three', 'four', 'five'])

In [28]:
dataframe1

        one       two     three      four      five
A -0.104411 -0.531280  1.029733 -0.438136 -1.118318
B  1.618982  1.541605 -0.251879 -0.842436  0.184519
C  0.937082  0.731000  1.361556 -0.326238  0.055676

In [29]:
dataframe1[dataframe1['one'] < 0]

        one      two     three      four      five
A -0.104411 -0.53128  1.029733 -0.438136 -1.118318

In [30]:
titanic = pandas.read_csv('../../data/kapal_titanic.csv')

In [31]:
titanic

     survived  pclass     sex   age  sibsp  parch     fare embarked deck
0           0       3    male  22.0      1      0   7.2500        S  NaN
1           1       1  female  38.0      1      0  71.2833        C    C
2           1       3  female  26.0      0      0   7.9250        S  NaN
3           1       1  female  35.0      1      0  53.1000        S    C
4           0       3    male  35.0      0      0   8.0500        S  NaN
..        ...     ...     ...   ...    ...    ...      ...      ...  ...
886         0       2    male  27.0      0      0  13.0000        S  NaN
887         1       1  female  19.0      0      0  30.0000        S    B
888         0       3  female   NaN      1      2  23.4500        S  NaN
889         1       1    male  26.0      0      0  30.0000        C    C
890         0       3    male  32.0      0      0   7.7500        Q  NaN

[891 rows x 9 columns]

In [32]:
ages = titanic['age']

In [33]:
ages

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64

In [34]:
ages.describe()

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: age, dtype: float64

In [35]:
ages.min()

0.42

In [36]:
titanic

     survived  pclass     sex   age  sibsp  parch     fare embarked deck
0           0       3    male  22.0      1      0   7.2500        S  NaN
1           1       1  female  38.0      1      0  71.2833        C    C
2           1       3  female  26.0      0      0   7.9250        S  NaN
3           1       1  female  35.0      1      0  53.1000        S    C
4           0       3    male  35.0      0      0   8.0500        S  NaN
..        ...     ...     ...   ...    ...    ...      ...      ...  ...
886         0       2    male  27.0      0      0  13.0000        S  NaN
887         1       1  female  19.0      0      0  30.0000        S    B
888         0       3  female   NaN      1      2  23.4500        S  NaN
889         1       1    male  26.0      0      0  30.0000        C    C
890         0       3    male  32.0      0      0   7.7500        Q  NaN

[891 rows x 9 columns]

In [37]:
sum(titanic['sibsp'])

466

In [38]:
age = titanic.age

In [39]:
age = age.tail(5)
age = age.dropna()

In [40]:
age

886    27.0
887    19.0
889    26.0
890    32.0
Name: age, dtype: float64

In [41]:
titanic[17:20]

    survived  pclass     sex   age  sibsp  parch    fare embarked deck
17         1       2    male   NaN      0      0  13.000        S  NaN
18         0       3  female  31.0      1      0  18.000        S  NaN
19         1       3  female   NaN      0      0   7.225        C  NaN

In [42]:
titanic[17:20].dropna(axis=0, thresh=1)

    survived  pclass     sex   age  sibsp  parch    fare embarked deck
17         1       2    male   NaN      0      0  13.000        S  NaN
18         0       3  female  31.0      1      0  18.000        S  NaN
19         1       3  female   NaN      0      0   7.225        C  NaN

In [43]:
titanic[17:20].fillna(value=2.5)

    survived  pclass     sex   age  sibsp  parch    fare embarked  deck
17         1       2    male   2.5      0      0  13.000        S   2.5
18         0       3  female  31.0      1      0  18.000        S   2.5
19         1       3  female   2.5      0      0   7.225        C   2.5

In [44]:
titanic.head().sex.values

array(['male', 'female', 'female', 'female', 'male'], dtype=object)